# 2531 회전초밥
'''
새로 문을 연 회전 초밥 음식점이 불경기로 영업이 어려워서, 다음과 같이 두 가지 행사를 통해서 매상을 올리고자 한다.
(7, 9, 7, 30, 2, 7, 9, 25)  - 반복

원래 회전 초밥은 손님이 마음대로 초밥을 고르고, 먹은 초밥만큼 식대를 계산하지만, 
벨트의 임의의 한 위치부터 k개의 접시를 연속해서 먹을 경우 할인된 정액 가격으로 제공한다.

각 고객에게 초밥의 종류 하나가 쓰인 쿠폰을 발행하고, 1번 행사에 참가할 경우 이 쿠폰에 적혀진 종류의 초밥 하나를 추가로 무료로 제공한다.
만약 이 번호에 적혀진 초밥이 현재 벨트 위에 없을 경우, 요리사가 새로 만들어 손님에게 제공한다.
위 할인 행사에 참여하여 가능한 한 다양한 종류의 초밥을 먹으려고 한다.
위 그림의 예를 가지고 생각해보자. k=4이고, 30번 초밥을 쿠폰으로 받았다고 가정하자. 
쿠폰을 고려하지 않으면 4가지 다른 초밥을 먹을 수 있는 경우는 
(9, 7, 30, 2), (30, 2, 7, 9), (2, 7, 9, 25) 세 가지 경우가 있는데, 
30번 초밥을 추가로 쿠폰으로 먹을 수 있으므로 (2, 7, 9, 25)를 고르면 5가지 종류의 초밥을 먹을 수 있다.

회전 초밥 음식점의 벨트 상태, 
메뉴에 있는 초밥의 가짓수, 
연속해서 먹는 접시의 개수, 
쿠폰 번호가 주어졌을 때, 
손님이 먹을 수 있는 초밥 가짓수의 최댓값을 구하는 프로그램을 작성하시오.

입력
첫 번째 줄에는 회전 초밥 벨트에 놓인 접시의 수 N,
초밥의 가짓수 d,
연속해서 먹는 접시의 수 k,
쿠폰 번호 c가 각각 하나의 빈 칸을 사이에 두고 주어진다. 
단, 2 ≤ N ≤ 30,000, 2 ≤ d ≤ 3,000, 2 ≤ k ≤ 3,000 (k ≤ N), 1 ≤ c ≤ d이다.

두 번째 줄부터 N개의 줄에는 벨트의 한 위치부터 시작하여
회전 방향을 따라갈 때 초밥의 종류를 나타내는 1 이상 d 이하의 정수가 각 줄마다 하나씩 주어진다.

출력
주어진 회전 초밥 벨트에서 먹을 수 있는 초밥의 가짓수의 최댓값을 하나의 정수로 출력한다.
'''
# 3:13
# Q. 동일한 초밥은 먹을 수 없는 건가? ***
# --> A. 아 맥시멈 초밥 가짓수라서, 중복되는건 무시하나봄
# 벨트(Stack) 한 바퀴 다 돌면 그걸로 끝. 새로운 초밥 추가는 없는듯

N, d, k, c = map(int, input().split())

def sushi_promotion(n, k, c):
    # CREATE EMPTY LISTS
    belt = []
    temp_belt = []
    
    # 회전 초밥 벨트 채우기
    for _ in range(n):
        sushi = int(input())
        belt.append(sushi)
    
    max_counts = 0
    for i in range(n):
        # temp_belt = belt[i:k+i]
        # print(temp_belt)
        
        # ***코드 참조! 원형 벨트 처리
        if i + k <= n:   # 초밥들 벨트 범위안에 있을 때
            temp_belt = belt[i : k+i]
        else:
            # ***!! 여기 두번째 belt 슬라이싱 범위 이해 잘 안감. 왜?
            # 초밥 컨베이어 벨트의 남은 개수가 k 보다 적게 남아있을 경우, 벨트 앞부분이랑 연결
            temp_belt = belt[i:] + belt[ :(i+k) % n]
        
        # 리스트 안에 중복 스시 넘버 체크
        filtered_temp_belt = set(temp_belt)
        # 쿠폰 사용 유무 체크
        if c not in filtered_temp_belt:
            coupon = 1
        else:
            coupon = 0
            
        # 최대 가짓수 체크 
        counts = len(filtered_temp_belt) + coupon
        if max_counts < counts:
            max_counts = counts
            
    print(max_counts)
        
# Check range
if not (2 <= N <= 30000 and 2 <= d <= 3000 and 2 <= k <= 3000 and k <= N and 1 <= c <= d):
    exit()
else:
    sushi_promotion(N, k, c)

# 5:46
